Hi @Nareshcbit 

This is a regression indeed but there is a  workaround for the issue 

[instance_type](https://registry.terraform.io/providers/vmware/vmc/latest/docs/data-sources/customer_subnets#instance_type) - (Optional) The server instance type to be used.

[sddc_type](https://registry.terraform.io/providers/vmware/vmc/latest/docs/data-sources/customer_subnets#sddc_type) - (Optional) The sddc type to be used. (1NODE, SingleAZ, MultiAZ)

Fields must be specified and the terraform plan command is passing. Tested with v1.13.1

HCL code 
```
terraform {
  required_providers {
    vmc = {
      source  = "vmware/vmc"
      version = "1.13.1"
    }
  }
}

provider "vmc" {
  client_id = var.client_id
  client_secret = var.client_secret
}

data "vmc_connected_accounts" "my_accounts" {
  account_number = var.aws_account_number
}

data "vmc_customer_subnets" "my_subnets" {
  connected_account_id = data.vmc_connected_accounts.my_accounts.id
  region               = var.sddc_region
  sddc_type = "SingleAZ"
  instance_type = "i3.metal"
}

resource "vmc_sddc" "sddc_1" {
  sddc_name           = "vasila-test-sddc-0"
  vpc_cidr            = "10.40.0.0/16"
  num_host            = 3
  provider_type       = "AWS"
  region              = var.sddc_region
  vxlan_subnet        = "192.168.1.0/24"
  delay_account_link  = false
  skip_creating_vxlan = false
  sso_domain          = "vmc.local"
  deployment_type     = "SingleAZ"

  account_link_sddc_config {
    customer_subnet_ids  = [data.vmc_customer_subnets.my_subnets.ids[0]]
    connected_account_id = data.vmc_connected_accounts.my_accounts.id
  }
  microsoft_licensing_config {
    mssql_licensing   = "ENABLED"
    windows_licensing = "DISABLED"
  }
  edrs_policy_type = "cost"
  enable_edrs      = true
  min_hosts        = 3
  max_hosts        = 8
}
```

Terraform command output:

```
% terraform plan   
data.vmc_connected_accounts.my_accounts: Reading...
data.vmc_connected_accounts.my_accounts: Read complete after 0s [id=xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx]
data.vmc_customer_subnets.my_subnets: Reading...
data.vmc_customer_subnets.my_subnets: Read complete after 2s [id=xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vmc_sddc.sddc_1 will be created
  + resource "vmc_sddc" "sddc_1" {
      + account_link_state       = (known after apply)
      + availability_zones       = (known after apply)
      + cloud_password           = (known after apply)
      + cloud_username           = (known after apply)
      + cluster_id               = (known after apply)
      + cluster_info             = (known after apply)
      + created                  = (known after apply)
      + delay_account_link       = false
      + deployment_type          = "SingleAZ"
      + edrs_policy_type         = "cost"
      + enable_edrs              = true
      + id                       = (known after apply)
      + intranet_mtu_uplink      = 1500
      + max_hosts                = 8
      + min_hosts                = 3
      + nsxt_cloudadmin          = (known after apply)
      + nsxt_cloudadmin_password = (known after apply)
      + nsxt_cloudaudit          = (known after apply)
      + nsxt_cloudaudit_password = (known after apply)
      + nsxt_private_ip          = (known after apply)
      + nsxt_private_url         = (known after apply)
      + nsxt_reverse_proxy_url   = (known after apply)
      + nsxt_ui                  = (known after apply)
      + num_host                 = 3
      + org_id                   = (known after apply)
      + provider_type            = "AWS"
      + region                   = "US_WEST_2"
      + sddc_access_state        = (known after apply)
      + sddc_name                = "vasila-test-sddc-0"
      + sddc_size                = (known after apply)
      + sddc_state               = (known after apply)
      + size                     = "medium"
      + skip_creating_vxlan      = false
      + sso_domain               = "vmc.local"
      + updated                  = (known after apply)
      + updated_by_user_id       = (known after apply)
      + updated_by_user_name     = (known after apply)
      + user_id                  = (known after apply)
      + user_name                = (known after apply)
      + vc_url                   = (known after apply)
      + version                  = (known after apply)
      + vpc_cidr                 = "10.40.0.0/16"
      + vxlan_subnet             = "192.168.1.0/24"

      + account_link_sddc_config {
          + connected_account_id = "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
          + customer_subnet_ids  = [
              + "subnet-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
            ]
        }

      + microsoft_licensing_config {
          + mssql_licensing   = "ENABLED"
          + windows_licensing = "DISABLED"
        }
    }
```